---
kind: property
id: P:Autodesk.Revit.DB.ParameterTypeId.ViewType
source: html/a7a386d6-3809-1214-8e53-895b1a29573f.htm
---
# Autodesk.Revit.DB.ParameterTypeId.ViewType Property

"Family and Type"

## Syntax (C#)
```csharp
public static ForgeTypeId ViewType { get; }
```